
[
  {
    "company": "Allens",
    "role": "Graduate Lawyer - Corporate",
    "salary": "95000",
    "bonus": "15000",
    "university": "University of Sydney",
    "wam": "78",
    "application_stages": "Online application, psychometric testing, partner interview, assessment centre with group exercise and presentation",
    "interview_experience": "Two rounds - first with HR and senior associate, second with partner. Asked about commercial awareness, why law, why Allens. Case study on M&A transaction.",
    "outcome": "Success",
    "advice": "Know the firm's recent deals and be able to discuss current commercial issues. Practice case studies beforehand.",
    "timestamp": "2024-01-15T10:30:00"
  },
  {
    "company": "Herbert Smith Freehills",
    "role": "Summer Clerk - Litigation",
    "salary": "",
    "bonus": "",
    "university": "UNSW",
    "wam": "75",
    "application_stages": "Online application, cover letter, video interview, final interview",
    "interview_experience": "Video interview was 30 mins with pre-recorded questions. Final interview was competency-based with examples of teamwork, leadership, problem-solving.",
    "outcome": "Success",
    "advice": "Prepare STAR method examples for all competency questions. Research the firm's practice areas thoroughly.",
    "timestamp": "2024-01-20T14:15:00"
  },
  {
    "company": "King & Wood Mallesons",
    "role": "Graduate Lawyer - Banking & Finance",
    "salary": "92000",
    "bonus": "10000",
    "university": "University of Melbourne",
    "wam": "80",
    "application_stages": "Application, online testing, phone screening, assessment centre",
    "interview_experience": "Assessment centre included group negotiation exercise, individual presentation on a legal issue, and panel interview with 3 partners.",
    "outcome": "Success",
    "advice": "Be collaborative in group exercises but still stand out. Know recent regulatory changes in banking law.",
    "timestamp": "2024-01-25T09:45:00"
  },
  {
    "company": "Clayton Utz",
    "role": "Clerkship - Commercial Litigation",
    "salary": "",
    "bonus": "",
    "university": "Monash University",
    "wam": "72",
    "application_stages": "Online application, Watson Glaser test, two interview rounds",
    "interview_experience": "First interview with graduate recruitment, second with litigation partners. Discussed a recent High Court case and its implications.",
    "outcome": "Success",
    "advice": "Stay updated on recent court decisions. Practice logical reasoning tests online before the Watson Glaser.",
    "timestamp": "2024-02-01T16:20:00"
  },
  {
    "company": "MinterEllison",
    "role": "Graduate Lawyer - Employment",
    "salary": "88000",
    "bonus": "8000",
    "university": "UTS",
    "wam": "74",
    "application_stages": "Application, psychometric testing, group interview, partner interview",
    "interview_experience": "Group interview was a case study on workplace relations. Partner interview focused on why employment law and commercial scenarios.",
    "outcome": "Success",
    "advice": "Understand current IR reforms and Fair Work Act changes. Be prepared to discuss workplace trends post-COVID.",
    "timestamp": "2024-02-10T11:30:00"
  },
  {
    "company": "Corrs Chambers Westgarth",
    "role": "Summer Clerk - Corporate",
    "salary": "",
    "bonus": "",
    "university": "University of Queensland",
    "wam": "76",
    "application_stages": "Online application, video interview, final round interview",
    "interview_experience": "Video interview technical difficulties caused stress. Final interview went well - discussed recent M&A activity and ESG considerations.",
    "outcome": "Rejected",
    "advice": "Test technology beforehand for video interviews. Have backup internet connection if possible.",
    "timestamp": "2024-02-15T13:45:00"
  },
  {
    "company": "Ashurst",
    "role": "Graduate Lawyer - Projects",
    "salary": "90000",
    "bonus": "12000",
    "university": "Australian National University",
    "wam": "77",
    "application_stages": "Application, online testing, case study presentation, final interview",
    "interview_experience": "Had to present on infrastructure project financing to a panel. Questions about energy transition and regulatory frameworks.",
    "outcome": "Success",
    "advice": "Know the energy sector inside out if applying for projects. Understand government policy on renewable energy.",
    "timestamp": "2024-02-20T08:15:00"
  },
  {
    "company": "Gilbert + Tobin",
    "role": "Clerkship - Competition & Regulation",
    "salary": "",
    "bonus": "",
    "university": "University of Adelaide",
    "wam": "79",
    "application_stages": "Application, numerical and verbal reasoning tests, partner interview",
    "interview_experience": "Partner was tough but fair. Asked about ACCC recent decisions and competition law principles. Had to analyse a hypothetical merger.",
    "outcome": "Success",
    "advice": "G+T loves commercial awareness. Read AFR daily and know recent ACCC/ASIC enforcement actions.",
    "timestamp": "2024-02-28T15:00:00"
  },
  {
    "company": "Baker McKenzie",
    "role": "Graduate Lawyer - Tax",
    "salary": "87000",
    "bonus": "7000",
    "university": "Macquarie University",
    "wam": "73",
    "application_stages": "Application, psychometric testing, technical interview, culture fit interview",
    "interview_experience": "Technical interview on tax law concepts. Culture fit focused on international mindset and working in global teams.",
    "outcome": "Success",
    "advice": "Bakers is very international - demonstrate global perspective and language skills if you have them.",
    "timestamp": "2024-03-05T12:20:00"
  },
  {
    "company": "Linklaters",
    "role": "Summer Clerk - Capital Markets",
    "salary": "",
    "bonus": "",
    "university": "University of Western Australia",
    "wam": "71",
    "application_stages": "Application, SHL testing, video interview, assessment centre",
    "interview_experience": "Assessment centre was intense - group exercise, individual interview, written exercise on regulatory change in capital markets.",
    "outcome": "Rejected",
    "advice": "Practice group exercises focusing on listening and building on others' ideas, not just leading. Know securities law basics.",
    "timestamp": "2024-03-10T09:30:00"
  },
  {
    "company": "Norton Rose Fulbright",
    "role": "Graduate Lawyer - Energy & Infrastructure",
    "salary": "89000",
    "bonus": "9000",
    "university": "Griffith University",
    "wam": "75",
    "application_stages": "Application, aptitude testing, phone interview, final interview",
    "interview_experience": "Phone interview was screening for technical knowledge. Final interview with energy partners about renewable energy projects and regulatory challenges.",
    "outcome": "Success",
    "advice": "NRF energy team is top tier. Need genuine interest in sector and understanding of policy landscape.",
    "timestamp": "2024-03-15T14:45:00"
  },
  {
    "company": "DLA Piper",
    "role": "Clerkship - Real Estate",
    "salary": "",
    "bonus": "",
    "university": "Curtin University",
    "wam": "70",
    "application_stages": "Application, online testing, group interview, partner meeting",
    "interview_experience": "Group interview involved negotiating a property deal. Partner meeting was more informal, discussing career goals and firm culture.",
    "outcome": "Success",
    "advice": "DLA Piper values diverse backgrounds. Highlight any non-legal experience that shows commercial skills.",
    "timestamp": "2024-03-20T10:10:00"
  }
]
